In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/

In [2]:
%%sql

show databases;

 * mysql+mysqlconnector://root:***@localhost/
7 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('placements_prep',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [3]:
%%sql

# create database placements_prep;

show databases;

 * mysql+mysqlconnector://root:***@localhost/
7 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('placements_prep',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [4]:
%%sql

# drop database placement_prep;

use placements_prep;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [5]:
%%sql

create table test (sno  int, name varchar(100));

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [6]:
%%sql

select * from test;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [7]:
%%sql

insert into test (sno, name) values (1, 'venkat');

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [8]:
%%sql

select * from test;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(1, 'venkat')]

In [9]:
%%sql

update test set name='venkatesan', sno = 3 where sno = 1;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [10]:
%%sql

select * from test;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(3, 'venkatesan')]

In [11]:
%%sql

delete from test where sno = 3;
select * from test;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.
0 rows affected.

[]

In [12]:
%%sql

truncate table test;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [13]:
%%sql

drop table test;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [14]:
%%sql


CREATE TABLE Emp(
    emp_id INT PRIMARY KEY,
    f_name VARCHAR(50) NOT NULL,
    l_name VARCHAR(50) NOT NULL,
    join_date DATE NOT NULL,
    salary DECIMAL(10, 2)
);

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'emp' already exists
[SQL: CREATE TABLE Emp(
    emp_id INT PRIMARY KEY,
    f_name VARCHAR(50) NOT NULL,
    l_name VARCHAR(50) NOT NULL,
    join_date DATE NOT NULL,
    salary DECIMAL(10, 2)
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [15]:
%%sql

#CTAS, table created by selecting another table

CREATE TABLE Top_Emp AS 
SELECT 
    emp_id,
    f_name,
    l_name,
    salary
FROM Emp
WHERE salary > 50000

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'Top_Emp' already exists
[SQL: #CTAS, table created by selecting another table

CREATE TABLE Top_Emp AS
SELECT
    emp_id,
    f_name,
    l_name,
    salary
FROM Emp
WHERE salary > 50000]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [16]:
%%sql

CREATE TEMPORARY TABLE Temp_Emp (
    emp_id INT PRIMARY KEY,
    salary DECIMAL(10, 2)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [17]:
%%sql

INSERT INTO Temp_Emp
SELECT 
    emp_id,
    salary
FROM Emp
WHERE salary > 50000;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [26]:
%%sql

WITH High_Salary AS (
    SELECT emp_id, f_name, l_name, salary
    FROM Emp
    WHERE salary > 70000
)
SELECT * 
FROM High_Salary
WHERE f_name LIKE 'A%';

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [34]:
%%sql

drop table if exists Emp;

CREATE TABLE Emp(
    emp_id INT PRIMARY KEY,
    f_name VARCHAR(50) NOT NULL,
    l_name VARCHAR(50) NOT NULL,
    join_date DATE NOT NULL,
    salary DECIMAL(10, 2)
);

ALTER TABLE Emp
ADD Email VARCHAR(100);

DESCRIBE Emp;


ALTER TABLE Emp
DROP column Email;

DESCRIBE Emp;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.
6 rows affected.
0 rows affected.
5 rows affected.

[('emp_id', 'int', 'NO', 'PRI', None, ''),
 ('f_name', 'varchar(50)', 'NO', '', None, ''),
 ('l_name', 'varchar(50)', 'NO', '', None, ''),
 ('join_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, '')]

In [37]:
%%sql

ALTER TABLE Emp rename to EMP;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [39]:
%%sql

DESC EMP;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('emp_id', 'int', 'NO', 'PRI', None, ''),
 ('f_name', 'varchar(50)', 'NO', '', None, ''),
 ('l_name', 'varchar(50)', 'NO', '', None, ''),
 ('join_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, '')]

In [45]:
%%sql

drop table if exists UBER;

CREATE TABLE UBER(
    ride_id INT,
    driver_id INT,
    rider_id INT,
    pickup_location VARCHAR(100),
    dropoff_location VARCHAR(100),
    ride_date DATETIME,
    fare DECIMAL(10, 2)
);

desc UBER;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
7 rows affected.

[('ride_id', 'int', 'YES', '', None, ''),
 ('driver_id', 'int', 'YES', '', None, ''),
 ('rider_id', 'int', 'YES', '', None, ''),
 ('pickup_location', 'varchar(100)', 'YES', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'YES', '', None, ''),
 ('ride_date', 'datetime', 'YES', '', None, ''),
 ('fare', 'decimal(10,2)', 'YES', '', None, '')]

In [46]:
%%sql

INSERT INTO UBER (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 101, 201, 'Chennai', 'Coimbatore', '2025-09-05 10:30:00', 1500.50),
(2, 102, 202, 'Bangalore', 'Mysore', '2025-09-05 14:15:00', 900.00),
(3, 103, 203, 'Delhi', 'Agra', '2025-09-04 08:45:00', 2500.75),
(4, 104, 204, 'Mumbai', 'Pune', '2025-09-03 19:20:00', 1200.00),
(5, 105, 205, 'Hyderabad', 'Vizag', '2025-09-02 07:00:00', 3000.00);

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[]

In [50]:
%%sql

select * from UBER
where fare > 1500;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 101, 201, 'Chennai', 'Coimbatore', datetime.datetime(2025, 9, 5, 10, 30), Decimal('1500.50')),
 (3, 103, 203, 'Delhi', 'Agra', datetime.datetime(2025, 9, 4, 8, 45), Decimal('2500.75')),
 (5, 105, 205, 'Hyderabad', 'Vizag', datetime.datetime(2025, 9, 2, 7, 0), Decimal('3000.00'))]